# Brewfile: https://github.com/Homebrew/homebrew-bundle

cask_args appdir: "/Applications"
tap "habitat-sh/habitat"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "railwaycat/emacsmacport"

# app store
mas "1Password 7", id: 1333542190
mas "Airmail 3", id: 918858936
mas "Agenda", id:1287445660
mas "Amphetamine", id: 937984704
mas "Evernote", id: 406056744
mas "Fantastical 2", id: 975937182
mas "Magnet", id: 441258766
mas "Quiver", id: 866773894
mas "Shush", id: 496437906
mas "Slack", id: 803453959
mas "Spillo", id: 873245660
mas "Textual 7", id: 1262957439
mas "The Unarchiver", id: 425424353
mas "Things 3", id: 904280696
mas "Whatsapp Desktop", id: 1147396723

# languages
brew "python"
brew "go"

# tools
brew "aspell"
brew "bash"
brew "bc"
brew "fzf"
brew "git"
brew "htop-osx"
brew "ipcalc"
brew "jq"
brew "mas"
brew "mtr"
brew "node"
brew "protobuf"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "wget"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "habitat-sh/habitat/hab"
brew "railwaycat/emacsmacport/emacs-mac", args: ["HEAD", "with-spacemacs-icon"]

# devops tools
brew "awscli"
brew "azure-cli"
brew "packer"
brew "terraform"

# casks
cask "alfred"
cask "iterm2"
cask "spotify"

# infosec tools
brew "chkrootkit"
brew "nmap"